**Author: EPHANTUS WANDUA**  
Using SQL in Python (Jupyter Notebook)- pandas and ipython-sql(SQL MAGIC FUNCTION)
In this notebook, we are discussing how you can use the sql in Python. You can continue analysing data in Jupyter Notebook when you have the data in sql. In addition, you can integrate the SQL in Python to enable you 
to create a Graphical User Interface (`GUI`) such as `Tkinter`, `Streamlit` and  `Plotydash`
To do this, I will create a file named `requirement.txt`, inside this file, I will give a list of the required libraries that I will use for the project. such as, SQLalchemy, pandas, pymsql, python-dotenv,ipython-sql, cryptography, and Jupyter
Also, I will require a python dot env file,this is the file that will contain the privacy that doesn't need to be exposed, such as `password`, `username`, `name `, etc

In [1]:
# Import required libraries
import pymysql
import sqlite3

from sqlalchemy import create_engine
import pandas as pd
from dotenv import load_dotenv
import os
from urllib.parse import quote_plus

As best practise, we would define our database credentials as an environment variable rather than hardcoding in our notebooks or scriptfor this we are using `python-dotenv`

In [2]:
load_dotenv()

True

In [3]:
# Load environment variables
username = os.getenv('MYSQL_USER')
password = os.getenv('MYSQL_PASSWORD')
host = os.getenv('MYSQL_HOST')
port = os.getenv('mysql_port', 3306)
database = os.getenv('MYSQL_DB')

## SQL with PANDAS

There three easy options to create a connection to database are;
1. Using the python driver API(DBAPI2) directly
2. Sqlalchemy connection
3. Python string URI - SQlite only

### DBAPI2

In [4]:
# connect to MYSQL database
con = pymysql.connect(
    host=host,
    user=username,
    password=password,
    port=int(port),
    database= database
)

query= 'select * from classic_employees'

# read the data from database using pandas
df = pd.read_sql(sql=query, con=con)

C:\Users\ephan\AppData\Local\Temp\ipykernel_11604\680641928.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql=query, con=con)

In [5]:
database

'Classic'

In [6]:
host

'localhost'

In [7]:
df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,employeeName
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,None,President,DianeMurphy
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales,MaryPatterson
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing,JeffFirrelli
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC),WilliamPatterson
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA),GerardBondur

In [8]:
# Sqlite connection and write to it
con = sqlite3.connect('database.db') #creates the file if it does not exist

df.to_sql('classic_employees', con=con, if_exists='replace', index=False)
con.close()

**Sqlalchamey conection - create_engine()**

In [9]:
""" The string form of the URL is
``dialect[+driver]:/user:password@host/dbname[?key=value...]``

"""

' The string form of the URL is\n``dialect[+driver]:/user:password@host/dbname[?key=value...]``\n\n'

In [10]:
# Create a SQLALCHEMY connection engine
safe_password = quote_plus(password)

connection_string = (f"mysql+pymysql://{username}:{safe_password}@{host}:3306/{database}")
engine = create_engine(connection_string)

In [11]:
# Write data back to database to demonstrate write operation with engine
with engine.connect() as con:df.to_sql('employees_backup',con=con,if_exists='replace',index=False)

In [12]:
df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,employeeName
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,None,President,DianeMurphy
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales,MaryPatterson
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing,JeffFirrelli
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC),WilliamPatterson
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA),GerardBondur

In [13]:
query = """
select *
FROM employees_backup
"""
df1 = pd.read_sql(query, engine)

In [14]:
df1.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,employeeName
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,None,President,DianeMurphy
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales,MaryPatterson
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing,JeffFirrelli
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC),WilliamPatterson
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA),GerardBondur

In [15]:
 # SQLITE: URL- no SQLALCHEMY needed
df = pd.read_sql(
    "select * from classic_employees where reportsTO = 1002",
    "sqlite:///database.db"
)
df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,employeeName
0,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales,MaryPatterson
1,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing,JeffFirrelli

 ### Run SQL in Jupyter using SQL Magic

In [16]:
# load sql magic
%load_ext sql

In [17]:
# Connection to magic function using the sqlalchemy string
%sql $connection_string

In [18]:
# Verify styles available
import prettytable
print(prettytable.__dict__.keys())

dict_keys(['__name__', '__doc__', '__package__', '__loader__', '__spec__', '__path__', '__file__', '__cached__', '__builtins__', 'annotations', 'Any', '_version', '__version__', 'prettytable', '_DEPRECATED_ALL', '_DEPRECATED_DEFAULT', '_DEPRECATED_DOUBLE_BORDER', '_DEPRECATED_FRAME', '_DEPRECATED_HEADER', '_DEPRECATED_MARKDOWN', '_DEPRECATED_MSWORD_FRIENDLY', '_DEPRECATED_NONE', '_DEPRECATED_ORGMODE', '_DEPRECATED_PLAIN_COLUMNS', '_DEPRECATED_RANDOM', '_DEPRECATED_SINGLE_BORDER', 'HRuleStyle', 'PrettyTable', 'RowType', 'TableHandler', 'TableStyle', 'VRuleStyle', '_warn_deprecation', 'from_csv', 'from_db_cursor', 'from_html', 'from_html_one', 'from_json', 'from_mediawiki', '__all__', '__getattr__'])

In [19]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [20]:
# Explore columns in tables
%sql SELECT * FROM classic_employees limit 5

 * mysql+pymysql://root:***@localhost:3306/Classic
5 rows affected.

[(1002, 'Murphy', 'Diane', 'x5800', 'dmurphy@classicmodelcars.com', 1, None, 'President', 'DianeMurphy'),
 (1056, 'Patterson', 'Mary', 'x4611', 'mpatterso@classicmodelcars.com', 1, '1002', 'VP Sales', 'MaryPatterson'),
 (1076, 'Firrelli', 'Jeff', 'x9273', 'jfirrelli@classicmodelcars.com', 1, '1002', 'VP Marketing', 'JeffFirrelli'),
 (1088, 'Patterson', 'William', 'x4871', 'wpatterson@classicmodelcars.com', 6, '1056', 'Sales Manager (APAC)', 'WilliamPatterson'),
 (1102, 'Bondur', 'Gerard', 'x5408', 'gbondur@classicmodelcars.com', 4, '1056', 'Sale Manager (EMEA)', 'GerardBondur')]

In [21]:
result = %sql SELECT * FROM classic_employees WHERE reportsTo = 1056

 * mysql+pymysql://root:***@localhost:3306/Classic
4 rows affected.

In [22]:
result

[(1088, 'Patterson', 'William', 'x4871', 'wpatterson@classicmodelcars.com', 6, '1056', 'Sales Manager (APAC)', 'WilliamPatterson'),
 (1102, 'Bondur', 'Gerard', 'x5408', 'gbondur@classicmodelcars.com', 4, '1056', 'Sale Manager (EMEA)', 'GerardBondur'),
 (1143, 'Bow', 'Anthony', 'x5428', 'abow@classicmodelcars.com', 1, '1056', 'Sales Manager (NA)', 'AnthonyBow'),
 (1621, 'Nishi', 'Mami', 'x101', 'mnishi@classicmodelcars.com', 5, '1056', 'Sales Rep', 'MamiNishi')]

In [23]:
%%sql
SELECT employeeNumber, lastName, FirstName, jobTitle
FROM classic_employees 
limit 10

 * mysql+pymysql://root:***@localhost:3306/Classic
10 rows affected.

[(1002, 'Murphy', 'Diane', 'President'),
 (1056, 'Patterson', 'Mary', 'VP Sales'),
 (1076, 'Firrelli', 'Jeff', 'VP Marketing'),
 (1088, 'Patterson', 'William', 'Sales Manager (APAC)'),
 (1102, 'Bondur', 'Gerard', 'Sale Manager (EMEA)'),
 (1143, 'Bow', 'Anthony', 'Sales Manager (NA)'),
 (1165, 'Jennings', 'Leslie', 'Sales Rep'),
 (1166, 'Thompson', 'Leslie', 'Sales Rep'),
 (1188, 'Firrelli', 'Julie', 'Sales Rep'),
 (1216, 'Patterson', 'Steve', 'Sales Rep')]

In [24]:
%%sql results << 
select employeeNumber, lastname, firstname, jobtitle
from classic_employees

 * mysql+pymysql://root:***@localhost:3306/Classic
23 rows affected.
Returning data to local variable results

In [25]:
results

[(1002, 'Murphy', 'Diane', 'President'),
 (1056, 'Patterson', 'Mary', 'VP Sales'),
 (1076, 'Firrelli', 'Jeff', 'VP Marketing'),
 (1088, 'Patterson', 'William', 'Sales Manager (APAC)'),
 (1102, 'Bondur', 'Gerard', 'Sale Manager (EMEA)'),
 (1143, 'Bow', 'Anthony', 'Sales Manager (NA)'),
 (1165, 'Jennings', 'Leslie', 'Sales Rep'),
 (1166, 'Thompson', 'Leslie', 'Sales Rep'),
 (1188, 'Firrelli', 'Julie', 'Sales Rep'),
 (1216, 'Patterson', 'Steve', 'Sales Rep'),
 (1286, 'Tseng', 'Foon Yue', 'Sales Rep'),
 (1323, 'Vanauf', 'George', 'Sales Rep'),
 (1337, 'Bondur', 'Loui', 'Sales Rep'),
 (1370, 'Hernandez', 'Gerard', 'Sales Rep'),
 (1401, 'Castillo', 'Pamela', 'Sales Rep'),
 (1501, 'Bott', 'Larry', 'Sales Rep'),
 (1504, 'Jones', 'Barry', 'Sales Rep'),
 (1611, 'Fixter', 'Andy', 'Sales Rep'),
 (1612, 'Marsh', 'Peter', 'Sales Rep'),
 (1619, 'King', 'Tom', 'Sales Rep'),
 (1621, 'Nishi', 'Mami', 'Sales Rep'),
 (1625, 'Kato', 'Yoshimi', 'Sales Rep'),
 (1702, 'Gerard', 'Martin', 'Sales Rep')]

In [26]:
df = results.DataFrame()  # We can use this code to rewrite the above results as a dataframe
df

    employeeNumber   lastname firstname              jobtitle
0             1002     Murphy     Diane             President
1             1056  Patterson      Mary              VP Sales
2             1076   Firrelli      Jeff          VP Marketing
3             1088  Patterson   William  Sales Manager (APAC)
4             1102     Bondur    Gerard   Sale Manager (EMEA)
5             1143        Bow   Anthony    Sales Manager (NA)
6             1165   Jennings    Leslie             Sales Rep
7             1166   Thompson    Leslie             Sales Rep
8             1188   Firrelli     Julie             Sales Rep
9             1216  Patterson     Steve             Sales Rep
10            1286      Tseng  Foon Yue             Sales Rep
11            1323     Vanauf    George             Sales Rep
12            1337     Bondur      Loui             Sales Rep
13            1370  Hernandez    Gerard             Sales Rep
14            1401   Castillo    Pamela             Sales Rep
15            1501       Bott     Larry             Sales Rep
16            1504      Jones     Barry             Sales Rep
17            1611     Fixter      Andy             Sales Rep
18            1612      Marsh     Peter             Sales Rep
19            1619       King       Tom             Sales Rep
20            1621      Nishi      Mami             Sales Rep
21            1625       Kato   Yoshimi             Sales Rep
22            1702     Gerard    Martin             Sales Rep